### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_api_new["37f5c554-a5dd-494f-876e-9448dbfe7f5b"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_api_new" {
      + account_name        = "io-p-cosmos-api"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "37f5c554-a5dd-494f-876e-9448dbfe7f5b"
      + resource_group_name = "io-p-rg-internal"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_api_new["fa7d0229-6f6f-423d-bf56-379059bfc1ba"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_api_new" {
      + account_name        = "io-p-cosmos-api"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "fa7d0229-6f6f-423d-bf56-379059bfc1ba"
      + resource_group_name = "io-p-rg-internal"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_com_new["37f5c554-a5dd-494f-876e-9448dbfe7f5b"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_com_new" {
      + account_name        = "io-p-itn-com-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "37f5c554-a5dd-494f-876e-9448dbfe7f5b"
      + resource_group_name = "io-p-itn-com-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_com_new["fa7d0229-6f6f-423d-bf56-379059bfc1ba"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_com_new" {
      + account_name        = "io-p-itn-com-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "fa7d0229-6f6f-423d-bf56-379059bfc1ba"
      + resource_group_name = "io-p-itn-com-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_cosmosdb_account_api_new["37f5c554-a5dd-494f-876e-9448dbfe7f5b"] will be created
  + resource "azurerm_role_assignment" "citizen_func_cosmosdb_account_api_new" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "37f5c554-a5dd-494f-876e-9448dbfe7f5b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_cosmosdb_account_api_new["fa7d0229-6f6f-423d-bf56-379059bfc1ba"] will be created
  + resource "azurerm_role_assignment" "citizen_func_cosmosdb_account_api_new" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fa7d0229-6f6f-423d-bf56-379059bfc1ba"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_io_com_cosmos_new["37f5c554-a5dd-494f-876e-9448dbfe7f5b"] will be created
  + resource "azurerm_role_assignment" "citizen_func_io_com_cosmos_new" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "37f5c554-a5dd-494f-876e-9448dbfe7f5b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_io_com_cosmos_new["fa7d0229-6f6f-423d-bf56-379059bfc1ba"] will be created
  + resource "azurerm_role_assignment" "citizen_func_io_com_cosmos_new" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fa7d0229-6f6f-423d-bf56-379059bfc1ba"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.module.citizen_func_autoscaler_new.azurerm_monitor_autoscale_setting.this will be created
  + resource "azurerm_monitor_autoscale_setting" "this" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-com-citizen-as-02"
      + resource_group_name = "io-p-itn-com-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "ModuleName"     = "azure_app_service_plan_autoscaler"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.1.3"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-com-citizen-asp-02"

      + profile {
          + name = "low_load_profile"

          + capacity {
              + default = 10
              + maximum = 30
              + minimum = 2
            }

          + recurrence {
              + days     = [
                  + "Monday",
                  + "Tuesday",
                  + "Wednesday",
                  + "Thursday",
                  + "Friday",
                  + "Saturday",
                  + "Sunday",
                ]
              + hours    = [
                  + 22,
                ]
              + minutes  = [
                  + 0,
                ]
              + timezone = "W. Europe Standard Time"
            }

          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-com-citizen-asp-02"
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 80
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT1M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-com-citizen-asp-02"
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 20
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT20M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
        }
      + profile {
          + name = jsonencode(
                {
                  + for  = "low_load_profile"
                  + name = "default"
                }
            )

          + capacity {
              + default = 11
              + maximum = 30
              + minimum = 6
            }

          + recurrence {
              + days     = [
                  + "Monday",
                  + "Tuesday",
                  + "Wednesday",
                  + "Thursday",
                  + "Friday",
                  + "Saturday",
                  + "Sunday",
                ]
              + hours    = [
                  + 5,
                ]
              + minutes  = [
                  + 0,
                ]
              + timezone = "W. Europe Standard Time"
            }

          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-com-citizen-asp-02"
                  + operator                 = "GreaterThan"
                  + statistic                = "Average"
                  + threshold                = 80
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT1M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
          + rule {
              + metric_trigger {
                  + divide_by_instance_count = false
                  + metric_name              = "CpuPercentage"
                  + metric_namespace         = "microsoft.web/serverfarms"
                  + metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-com-citizen-asp-02"
                  + operator                 = "LessThan"
                  + statistic                = "Average"
                  + threshold                = 20
                  + time_aggregation         = "Average"
                  + time_grain               = "PT1M"
                  + time_window              = "PT5M"
                }
              + scale_action {
                  + cooldown  = "PT20M"
                  + direction = "Decrease"
                  + type      = "ChangeCount"
                  + value     = 1
                }
            }
        }
    }

  # module.web_apps.module.citizen_func_new.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/[io-p-itn-com-citizen-func-02] Health Check Failed"
        name                     = "[io-p-itn-com-citizen-func-02] Health Check Failed"
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "4.0.0"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 9 to add, 1 to change, 0 to destroy.
```

</details>
